RT-Thread/rt-thread/bsp/nxp/imx/imxrt/imxrt1180-nxp-evk/cm7/board/MCUX_Config_hyperFlash/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/* GPIO_AD_27 (coord M16), USER_LED_CTL1 */
/* Routed pin properties */
#define BOARD_INITPINS_USER_LED_CTL1_PERIPHERAL                           RGPIO4   /*!< Peripheral name */
#define BOARD_INITPINS_USER_LED_CTL1_SIGNAL                              gpio_io   /*!< Signal name */
#define BOARD_INITPINS_USER_LED_CTL1_CHANNEL                                 27U   /*!< Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_USER_LED_CTL1_GPIO                                 RGPIO4   /*!< GPIO peripheral base pointer */
#define BOARD_INITPINS_USER_LED_CTL1_INIT_GPIO_VALUE                          0U   /*!< GPIO output initial state */
#define BOARD_INITPINS_USER_LED_CTL1_GPIO_PIN                                27U   /*!< GPIO pin number */
#define BOARD_INITPINS_USER_LED_CTL1_GPIO_PIN_MASK                   (1U << 27U)   /*!< GPIO pin mask */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);                    /* Function assigned for the Cortex-M7F */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/

